# Restore on a new Mac:
#   brew bundle install --file=macos/Brewfile
# Update this file from the current machine:
#   brew bundle dump --file=macos/Brewfile --force

# === Taps ===
tap "ddev/ddev"
tap "oven-sh/bun"
tap "pantheon-systems/external"

# === Formulae (CLI tools — only what was installed on request) ===
brew "act"
brew "chezmoi"
brew "cloudflare-wrangler"
brew "cloudflared"
brew "composer"
brew "ddev/ddev/ddev"
brew "exiftool"
brew "fastfetch"
brew "ffmpeg"
brew "gh"
brew "glab"
brew "go"
brew "graphviz"
brew "imagemagick"
brew "just"
brew "latexindent"
brew "llama.cpp"
brew "neovim"
brew "nginx"
brew "ollama"
brew "opencode"
brew "openjdk"
brew "pandoc"
brew "pantheon-systems/external/terminus"
brew "pipx"
brew "pnpm"
brew "poppler"
brew "rust"
brew "rustup"
brew "tree"
brew "typescript"
brew "typst"
brew "uv"
brew "yt-dlp"

# === Formulae (shell — zsh plugins, prompt, fuzzy finder) ===
brew "fzf"
brew "fzf-tab"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# === Casks: AI ===
cask "chatgpt"
cask "claude"
cask "codex-app"
cask "lm-studio"

# === Casks: Browsers ===
cask "google-chrome"
cask "helium-browser"
cask "zen"

# === Casks: Development ===
cask "docker-desktop"
cask "ghostty"
cask "github"
cask "jetbrains-toolbox"
cask "visual-studio-code"

# === Casks: Communication ===
cask "discord"
cask "viber"

# === Casks: Productivity ===
cask "applite"
cask "latest"
cask "maccy"
cask "netnewswire"
cask "obsidian"
cask "raycast"
cask "readest"
cask "shottr"

# === Casks: Media ===
cask "background-music"
cask "handbrake-app"
cask "iina"
cask "jdownloader"
cask "kodi"
cask "stremio"
cask "yacreader"

# === Casks: System / window management ===
cask "betterdisplay"
cask "karabiner-elements"
cask "keka"
cask "linearmouse"
cask "middleclick"
cask "monitorcontrol"
cask "mos"
cask "notunes"
cask "rectangle"

# === Casks: Cloud / sync ===
cask "google-drive"
cask "localsend"

# === Casks: VPN ===
cask "clearvpn"
cask "protonvpn"

# === Casks: Creative ===
cask "blip"
cask "inkscape"
cask "paintbrush"

# === Casks: Gaming ===
cask "modrinth"
cask "prismlauncher"
cask "roblox"
cask "steam"

# === Casks: LaTeX ===
cask "mactex-no-gui"

# === Mac App Store (requires `mas`; sign into the App Store first) ===
# Either App Store-only (no cask), or where the App Store build differs from the cask.
brew "mas"
mas "Bitwarden",                     id: 1352778147  # App Store build differs from cask
mas "AdGuard Mini",                  id: 1440147259
mas "Color Picker",                  id: 1545870783
mas "Focus for YouTube",             id: 1514703160
mas "HP Smart",                      id: 1474276998
mas "Compressor Creator Studio",     id: 6746516157
mas "Final Cut Pro Creator Studio",  id: 1631624924
mas "Pixelmator Pro Creator Studio", id: 6746662575
mas "Canva",                         id: 897446215
mas "Hidden Bar",                    id: 1452453066
mas "OneDrive",                      id: 823766827
mas "Telegram",                      id: 747648890
mas "TickTick",                      id: 966085870
mas "WhatsApp",                      id: 310633997

# === Verify before enabling ===
# Office: these casks install Microsoft's direct .pkg. Yours are App Store builds,
# so either add them as `mas` entries below or uncomment these casks — not both.
# cask "microsoft-excel"
# cask "microsoft-word"
# cask "microsoft-outlook"
# cask "microsoft-powerpoint"

# === No Homebrew cask and not App Store — install manually ===
# Google Docs/Sheets/Slides (Chrome PWAs), Grab2Text
